// Тройка Пифагора - три натуральных числа a < b < c, для которых выполняется равенство
// a2 + b2 = c2
// Например, 32 + 42 = 9 + 16 = 25 = 52.
// Существует только одна тройка Пифагора, для которой a + b + c = 1000.
// Найдите произведение abc.

package main

import "fmt"

func task9() {
	for a := 1; a < 1000; a++ {
		for b := a + 1; b < 1000; b++ {
			c := 1000 - a - b
			if c > b && a*a+b*b == c*c {
				fmt.Println("Тройка Пифагора:", a, b, c)
				fmt.Println("Произведение abc:", a*b*c)
				return
			}
		}
	}
}
func main() {
	task9()
}
